app/controllers/messages_controller.rb

    def create
        @message = current_user.messages.create(body: msg_params[:body], room_id: params[:room_id])
---
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 2], ["body", "test123"], ["created_at", "2022-05-09 03:32:14.217188"], ["updated_at", "2022-05-09 03:32:14.217188"]]