app/models/message.rb

  def confirm_participant
    return unless room.is_private

    is_participant = Participant.where(user_id: self.user.id, room_id: self.room.id).first
---
SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = ? AND "participants"."room_id" = ? ORDER BY "participants"."id" ASC LIMIT ?  [["user_id", 1], ["room_id", 5], ["LIMIT", 1]]